# Pandas Note

Two datasstructure of the pandas library are 
1) Series
2) DataFrames

Series = contents a sequence of one dimenssional data 

DataFrames = a more complex datastructure , is designed to contain cases with serveral data structure .

In [1]:
import pandas as pd 
import numpy as np

In [2]:
ser = pd.Series([1,2,3])

In [3]:
print ser

0    1
1    2
2    3
dtype: int64

The above output shows me the pandas series and the left side column shows me the indexes .

In [4]:
ser = pd.Series([10,4,-5,6,7],index=[1,2,3,4,5])

In [5]:
print ser

1    10
2     4
3    -5
4     6
5     7
dtype: int64

Here in the above output i changed the default index which starts from 0 , Now if i want to change the index let , the indexes should be order of string then

In [6]:
ser = pd.Series([10,4,-5,7,8],index=['a','b','c','d','e'])

In [7]:
print ser

a    10
b     4
c    -5
d     7
e     8
dtype: int64

This ser variable contains the values and also the index , so to get only the values and only the indexes . use values and index they will return the correspondings with an array .

In [8]:
print ser.values

[10  4 -5  7  8]

In [9]:
print ser.index

Index([u'a', u'b', u'c', u'd', u'e'], dtype='object')

Create pandas Series using numpy array

In [10]:
ser = pd.Series(np.arange(5),index=['a','b','c','d','e'])

In [11]:
print ser

a    0
b    1
c    2
d    3
e    4
dtype: int64

To filter values , i.e. let say i want the values which are greater than and equal to 3

In [12]:
print ser[ser>=3]

d    3
e    4
dtype: int64

To get only those indexes whose values are greater than or equal to 3

In [13]:
print ser[ser>=3].index

Index([u'd', u'e'], dtype='object')

Pandas Series also supports the Arithmatic operations

In [14]:
print ser+2

a    2
b    3
c    4
d    5
e    6
dtype: int64

In [15]:
print ser-2

a   -2
b   -1
c    0
d    1
e    2
dtype: int64

In [16]:
print ser/3

a    0.000000
b    0.333333
c    0.666667
d    1.000000
e    1.333333
dtype: float64

In [17]:
print ser*4

a     0
b     4
c     8
d    12
e    16
dtype: int64

In [18]:
print ser**2

a     0
b     1
c     4
d     9
e    16
dtype: int64

I can also make numpy operations on series

In [19]:
print np.log(ser)

a        -inf
b    0.000000
c    0.693147
d    1.098612
e    1.386294
dtype: float64

In [20]:
print np.sum(ser)

10

In [21]:
print np.mean(ser)

2.0

In [22]:
print np.median(ser)

2.0

To get the only the unique values from the Series Datastructure , pandas provide us a method called unique() which operates on the Series on which i am looking get only the unique entries . the unique() method returns an array of unique elements from the Series DataStructure.

In [24]:
ser = pd.Series([1,0,2,1,2,3],index=['white','red','red','orange','black','blue'])

In [25]:
print ser

white     1
red       0
red       2
orange    1
black     2
blue      3
dtype: int64

In [26]:
print ser.unique()

[1 0 2 3]

isin() is function that evaluates the membership , that is , give a list of values , this function lets you know if these values are contained within the data structure or not , it returns result in boolean format .

In [27]:
print ser.isin([0,3]) #looking is 0 and 3 present in my series

white     False
red        True
red       False
orange    False
black     False
blue       True
dtype: bool

The above o/p shows the True and False version , so what if i want to get the indexes and values for which the values i am searching for .

In [28]:
print ser[ser.isin([0,3])]

red     0
blue    3
dtype: int64

NaN = Not a Number is used withing pandas data structure to indicate the presence of an empty field or not definable numerically.

In [29]:
ser = pd.Series([5,-3,np.NaN,23])

In [30]:
print ser

0     5
1    -3
2   NaN
3    23
dtype: float64

Now , if i want to check in the series that , if any field in the series is null or not .

In [31]:
print ser.isnull()

0    False
1    False
2     True
3    False
dtype: bool

And if i want to check which fields are not null in the series

In [32]:
print ser.notnull()

0     True
1     True
2    False
3     True
dtype: bool

I want to print only those fields which are not null

In [33]:
print ser[ser.notnull()]

0     5
1    -3
3    23
dtype: float64

Print only those fields which are null

In [34]:
print ser[ser.isnull()]

2   NaN
dtype: float64

Creating Series with the help of python Dictonary

In [35]:
fruits = {'apple':{'china':10,'India':20},'Banna':{'Africa':100,'Asia':20}}

In [36]:
print fruits

{'Banna': {'Africa': 100, 'Asia': 20}, 'apple': {'India': 20, 'china': 10}}

In [37]:
print fruits.keys()

['Banna', 'apple']

In [38]:
print fruits.values()

[{'Africa': 100, 'Asia': 20}, {'India': 20, 'china': 10}]

In [39]:
print fruits['apple']

{'India': 20, 'china': 10}

In [41]:
print fruits['apple'].values()

[20, 10]

In [42]:
print fruits['apple'].keys()

['India', 'china']

In [43]:
fruitSeries = pd.Series(fruits)

In [44]:
print fruitSeries

Banna    {u'Africa': 100, u'Asia': 20}
apple     {u'India': 20, u'china': 10}
dtype: object

In [45]:
print fruitSeries.values

[{'Africa': 100, 'Asia': 20} {'India': 20, 'china': 10}]

In [46]:
print fruitSeries.index

Index([u'Banna', u'apple'], dtype='object')

In [47]:
print fruitSeries['apple']

{'India': 20, 'china': 10}

In [51]:
print fruitSeries['apple'].values()

[20, 10]

In [53]:
print fruitSeries['apple'].keys()

['India', 'china']

In [54]:
for apple in fruitSeries['apple'].values():
    print apple

20
10

In [55]:
total_apple = 0
for apple in fruitSeries['apple'].values():
    total_apple += apple
print total_apple

30

In [56]:
print fruitSeries.index

Index([u'Banna', u'apple'], dtype='object')

In [57]:
total_Banna = 0
for banna in fruitSeries['Banna'].values():
    total_Banna += banna
print total_Banna

120

In [58]:
print fruitSeries.index

Index([u'Banna', u'apple'], dtype='object')

In [59]:
print fruitSeries['apple']

{'India': 20, 'china': 10}

In [60]:
print fruitSeries['apple'].keys()

['India', 'china']

In [61]:
country_counter = 0
for counties in fruitSeries['apple'].keys():
    country_counter += 1
    print counties
print country_counter

India
china
2

# DataFrame

Defination :- The DataFrame is a tabular data structure very similar to the spreed sheet . DataFrames consists of an ordered collection of column. Unlike the series which had an Index array containing labels associated with each element. In the case of the data frames , there are two index array in Series . In fact , each label is associated with all the values in the row. The second array instead contains a series of labels, each associated with a particular column.

In [1]:
items = {'color':['red','blue','white'],'object':['pen','pencil','notebook'],'price':[10,20,30]}

In [2]:
print items

{'color': ['red', 'blue', 'white'], 'price': [10, 20, 30], 'object': ['pen', 'pencil', 'notebook']}

In [3]:
print items.keys()

['color', 'price', 'object']

In [5]:
print items.values()

[['red', 'blue', 'white'], [10, 20, 30], ['pen', 'pencil', 'notebook']]

In [7]:
print items['color']

['red', 'blue', 'white']

In [10]:
#Now to convert the python dictonary into DataFrame use python pandas DataFrame
import pandas as pd
df = pd.DataFrame(items)

In [11]:
print df

   color    object  price
0    red       pen     10
1   blue    pencil     20
2  white  notebook     30

In [12]:
print df['color']

0      red
1     blue
2    white
Name: color, dtype: object

In [14]:
print df.index

Int64Index([0, 1, 2], dtype='int64')

In [15]:
print df.values

[['red' 'pen' 10]
 ['blue' 'pencil' 20]
 ['white' 'notebook' 30]]

In [16]:
print df['price']

0    10
1    20
2    30
Name: price, dtype: int64

In [17]:
df

   color    object  price
0    red       pen     10
1   blue    pencil     20
2  white  notebook     30

In [18]:
print df

   color    object  price
0    red       pen     10
1   blue    pencil     20
2  white  notebook     30

In [19]:
df

   color    object  price
0    red       pen     10
1   blue    pencil     20
2  white  notebook     30

In the above dataframe the index are assigned automatically by pandas , now if i want to change the indexes .

In [20]:
df = pd.DataFrame(items,index=['item1','item2','item3'])

In [21]:
df

       color    object  price
item1    red       pen     10
item2   blue    pencil     20
item3  white  notebook     30

In [23]:
df.index

Index([u'item1', u'item2', u'item3'], dtype='object')

In [25]:
df.columns

Index([u'color', u'object', u'price'], dtype='object')

In [26]:
df.values

array([['red', 'pen', 10],
       ['blue', 'pencil', 20],
       ['white', 'notebook', 30]], dtype=object)

In [27]:
df['price']

item1    10
item2    20
item3    30
Name: price, dtype: int64

In [28]:
for p in df['price']:
    print p

10
20
30

Another way to create the DataFrames is to pass three items 
First = A Numpy array which will be reshaped as my data required
Second = index
Third = Columns

In [29]:
import numpy as np

In [47]:
np_frame = pd.DataFrame(np.arange(16).reshape((4,4)),index=['one','two','three','four'],
                        columns=['pencil','pen','notebook','eraser'])

In [31]:
np_frame

       pencil  pen  notebook  eraser
one         0    1         2       3
two         4    5         6       7
three       8    9        10      11
four       12   13        14      15

In [33]:
np_frame['pencil']

one       0
two       4
three     8
four     12
Name: pencil, dtype: int64

If i want to read the rows within the dataframe , i have to use ix[row_number] , which will show the values and column names in the particular row

In [35]:
np_frame.ix[2] #This will extract the 3nd row , whose index name is three

pencil       8
pen          9
notebook    10
eraser      11
Name: three, dtype: int64

To select multiple rows

In [36]:
np_frame[[1,3]] # This will select row number 1 and row number 3

       pen  eraser
one      1       3
two      5       7
three    9      11
four    13      15

In [40]:
np_frame.ix[1].pen

5

In [41]:
np_frame.ix[[1,3]].pen

two      5
four    13
Name: pen, dtype: int64

In [42]:
np_frame

       pencil  pen  notebook  eraser
one         0    1         2       3
two         4    5         6       7
three       8    9        10      11
four       12   13        14      15

In [43]:
for price in np_frame[[1,3]].pen:
    print price

1
5
9
13

In [44]:
sum = 0

In [45]:
for price in np_frame.ix[[1,3]].pen:
    sum += price

In [46]:
print sum

18

In [52]:
sum_pencil = 0
for price in np_frame.pencil:
    sum_pencil += price

In [53]:
print sum_pencil

24

To set the name of the index and columns , pandas provides us a way to do so , frame.index.name='name' and frame.columns.name='name'

In [54]:
np_frame.index.name='id'

In [55]:
np_frame.columns.name='items'

In [56]:
np_frame

items  pencil  pen  notebook  eraser
id
one         0    1         2       3
two         4    5         6       7
three       8    9        10      11
four       12   13        14      15

It is also possible to change index names

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [5]:
np_frame = pd.DataFrame(np.arange(16).reshape((4,4)),index=['one','two','three','Four'],
                        columns=['pen','pencil','notebook','eraser'])

In [6]:
np_frame

       pen  pencil  notebook  eraser
one      0       1         2       3
two      4       5         6       7
three    8       9        10      11
Four    12      13        14      15

In [7]:
np_frame.index=(1,2,3,4)

In [8]:
np_frame

   pen  pencil  notebook  eraser
1    0       1         2       3
2    4       5         6       7
3    8       9        10      11
4   12      13        14      15

In [9]:
np_frame.index.name='id'

In [10]:
np_frame.columns.name='items'

In [11]:
np_frame

items  pen  pencil  notebook  eraser
id
1        0       1         2       3
2        4       5         6       7
3        8       9        10      11
4       12      13        14      15

To add a new column in the DataFrame

In [12]:
np_frame['avalibility']='Yes'

In [13]:
np_frame

items  pen  pencil  notebook  eraser avalibility
id
1        0       1         2       3         Yes
2        4       5         6       7         Yes
3        8       9        10      11         Yes
4       12      13        14      15         Yes

To change the column name

In [14]:
np_frame = np_frame.rename(columns={'avalibility':'isPresent'})

In [15]:
np_frame

items  pen  pencil  notebook  eraser isPresent
id
1        0       1         2       3       Yes
2        4       5         6       7       Yes
3        8       9        10      11       Yes
4       12      13        14      15       Yes

Delete a column

In [16]:
del np_frame['isPresent']

In [17]:
np_frame

items  pen  pencil  notebook  eraser
id
1        0       1         2       3
2        4       5         6       7
3        8       9        10      11
4       12      13        14      15

Filter :- To get items which are greate are lesser than certian thresold

In [18]:
np_frame[np_frame>10]

items  pen  pencil  notebook  eraser
id
1      NaN     NaN       NaN     NaN
2      NaN     NaN       NaN     NaN
3      NaN     NaN       NaN      11
4       12      13        14      15

To access a particular index item of a particular item , syntax to do so frame['column_name']['index_name']

In [19]:
np_frame['pencil'][2]

5

In [20]:
np_frame

items  pen  pencil  notebook  eraser
id
1        0       1         2       3
2        4       5         6       7
3        8       9        10      11
4       12      13        14      15

DataFrame example with nested python dictonary

In [21]:
nested_dict = {'red':{2012:22,2013:33},'white':{2011:13,2012:14,2013:16},'blue':{2011:17,2013:19}}

In [22]:
nested_dict

{'blue': {2011: 17, 2013: 19},
 'red': {2012: 22, 2013: 33},
 'white': {2011: 13, 2012: 14, 2013: 16}}

In [23]:
nested_dict.keys()

['blue', 'white', 'red']

In [24]:
nested_dict['blue']

{2011: 17, 2013: 19}

In [25]:
nested_dict['blue'][2011]

17

In [26]:
nested_dict['blue'].keys()

[2011, 2013]

In [27]:
nested_dict['blue'].values()

[17, 19]

In [28]:
nested_frame = pd.DataFrame(nested_dict)

In [29]:
nested_frame

      blue  red  white
2011    17  NaN     13
2012   NaN   22     14
2013    19   33     16

In [30]:
nested_frame.index

Int64Index([2011, 2012, 2013], dtype='int64')

In [31]:
nested_frame.values

array([[ 17.,  nan,  13.],
       [ nan,  22.,  14.],
       [ 19.,  33.,  16.]])

To make the transpose of a frame

In [32]:
nested_frame.T

       2011  2012  2013
blue     17   NaN    19
red     NaN    22    33
white    13    14    16

Methods on Index

In [33]:
nested_frame.idxmin()

blue     2011
red      2012
white    2011
dtype: int64

In [34]:
nested_frame.idxmax()

blue     2013
red      2013
white    2013
dtype: int64

In [35]:
nested_frame['red']

2011   NaN
2012    22
2013    33
Name: red, dtype: float64

In [36]:
nested_frame['red'].idxmin()

2012

In [37]:
nested_frame['red'].idxmax()

2013

In [38]:
nested_frame.index.is_unique

True

Reindexing :- For reindexing pandas provide a function called reindex(), this function creates a new series object with the values of the previous Series rearranged according to the new sequence of labels.

In [39]:
ser = pd.Series(np.arange(4),index=['one','two','three','Four'])

In [40]:
ser

one      0
two      1
three    2
Four     3
dtype: int64

In [42]:
ser.reindex(['three','two','Four','one'])

three    2
two      1
Four     3
one      0
dtype: int64

In [43]:
ser.index

Index([u'one', u'two', u'three', u'Four'], dtype='object')

The drop() function helps to delete a index

In [44]:
ser.drop('Four')

one      0
two      1
three    2
dtype: int64

Arithmatic operations on DataFrame

In [45]:
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)),index=['one','two','three','four']
                      ,columns=['Apple','Mango','Cherry','FruitX'])

In [46]:
frame1

       Apple  Mango  Cherry  FruitX
one        0      1       2       3
two        4      5       6       7
three      8      9      10      11
four      12     13      14      15

In [54]:
frame2 = pd.DataFrame(np.arange(36).reshape((6,6)),index=['one','two','three','four','five','six']
                     ,columns=['Apple','Fruit2','Fruit3','FruitX','Fruit5','Fruit6'])

In [55]:
frame2

       Apple  Fruit2  Fruit3  FruitX  Fruit5  Fruit6
one        0       1       2       3       4       5
two        6       7       8       9      10      11
three     12      13      14      15      16      17
four      18      19      20      21      22      23
five      24      25      26      27      28      29
six       30      31      32      33      34      35

In [56]:
frame1.add(frame2)

       Apple  Cherry  Fruit2  Fruit3  Fruit5  Fruit6  FruitX  Mango
five     NaN     NaN     NaN     NaN     NaN     NaN     NaN    NaN
four      30     NaN     NaN     NaN     NaN     NaN      36    NaN
one        0     NaN     NaN     NaN     NaN     NaN       6    NaN
six      NaN     NaN     NaN     NaN     NaN     NaN     NaN    NaN
three     20     NaN     NaN     NaN     NaN     NaN      26    NaN
two       10     NaN     NaN     NaN     NaN     NaN      16    NaN

In [57]:
frame1.sub(frame2)

       Apple  Cherry  Fruit2  Fruit3  Fruit5  Fruit6  FruitX  Mango
five     NaN     NaN     NaN     NaN     NaN     NaN     NaN    NaN
four      -6     NaN     NaN     NaN     NaN     NaN      -6    NaN
one        0     NaN     NaN     NaN     NaN     NaN       0    NaN
six      NaN     NaN     NaN     NaN     NaN     NaN     NaN    NaN
three     -4     NaN     NaN     NaN     NaN     NaN      -4    NaN
two       -2     NaN     NaN     NaN     NaN     NaN      -2    NaN

In [58]:
frame1.mul(frame2)

       Apple  Cherry  Fruit2  Fruit3  Fruit5  Fruit6  FruitX  Mango
five     NaN     NaN     NaN     NaN     NaN     NaN     NaN    NaN
four     216     NaN     NaN     NaN     NaN     NaN     315    NaN
one        0     NaN     NaN     NaN     NaN     NaN       9    NaN
six      NaN     NaN     NaN     NaN     NaN     NaN     NaN    NaN
three     96     NaN     NaN     NaN     NaN     NaN     165    NaN
two       24     NaN     NaN     NaN     NaN     NaN      63    NaN

In [59]:
frame1.div(frame2)

          Apple  Cherry  Fruit2  Fruit3  Fruit5  Fruit6    FruitX  Mango
five        NaN     NaN     NaN     NaN     NaN     NaN       NaN    NaN
four   0.666667     NaN     NaN     NaN     NaN     NaN  0.714286    NaN
one         NaN     NaN     NaN     NaN     NaN     NaN  1.000000    NaN
six         NaN     NaN     NaN     NaN     NaN     NaN       NaN    NaN
three  0.666667     NaN     NaN     NaN     NaN     NaN  0.733333    NaN
two    0.666667     NaN     NaN     NaN     NaN     NaN  0.777778    NaN

The apply() function

In [60]:
frame = pd.Series(np.arange(6),index=['one','two','three','four','five','six'])

In [61]:
frame

one      0
two      1
three    2
four     3
five     4
six      5
dtype: int64

In [64]:
func = lambda x:x.max() + x.min()

In [65]:
frame.apply(func)

one       0
two       2
three     4
four      6
five      8
six      10
dtype: int64

In [66]:
frame.max()

5

In [67]:
frame.min()

0

Statistical operations on Frame

In [68]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),index=['one','two','three','four']
                    ,columns=['item1','item2','item3','item4'])

In [69]:
frame

       item1  item2  item3  item4
one        0      1      2      3
two        4      5      6      7
three      8      9     10     11
four      12     13     14     15

In [70]:
frame.sum()

item1    24
item2    28
item3    32
item4    36
dtype: int64

In [71]:
frame.sum().item1

24

In [73]:
frame.sum().item3

32

In [74]:
frame.mean()

item1    6
item2    7
item3    8
item4    9
dtype: float64

In [75]:
frame.mean().item2

7.0

In [76]:
frame.median()

item1    6
item2    7
item3    8
item4    9
dtype: float64

In [77]:
frame.median().item4

9.0

In [79]:
frame.describe()# describe() function allows to obtain a summary statistics at once

           item1      item2      item3      item4
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

Sorting

In [80]:
ser = pd.Series(np.arange(4),index=['red','blue','white','green'])

In [81]:
ser

red      0
blue     1
white    2
green    3
dtype: int64

In [82]:
ser.sort_index()

blue     1
green    3
red      0
white    2
dtype: int64

In [83]:
ser.sort_values()

red      0
blue     1
white    2
green    3
dtype: int64

In [90]:
ser.order()

/usr/local/lib/python2.7/dist-packages/ipykernel/__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

red      0
blue     1
white    2
green    3
dtype: int64

In [91]:
ser.rank()

red      1
blue     2
white    3
green    4
dtype: float64

In [92]:
ser.rank(ascending=False)

red      4
blue     3
white    2
green    1
dtype: float64

In [94]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),index=['one','two','three','Four'],
                    columns=['item1','item2','item3','item4'])

In [95]:
frame

       item1  item2  item3  item4
one        0      1      2      3
two        4      5      6      7
three      8      9     10     11
Four      12     13     14     15

In [96]:
frame.sort_index()

       item1  item2  item3  item4
Four      12     13     14     15
one        0      1      2      3
three      8      9     10     11
two        4      5      6      7

In [98]:
frame.sort_values(by='item1')

       item1  item2  item3  item4
one        0      1      2      3
two        4      5      6      7
three      8      9     10     11
Four      12     13     14     15

In [101]:
frame.sort_index

<bound method DataFrame.sort_index of        item1  item2  item3  item4
one        0      1      2      3
two        4      5      6      7
three      8      9     10     11
Four      12     13     14     15>

In [102]:
frame.rank()

       item1  item2  item3  item4
one        1      1      1      1
two        2      2      2      2
three      3      3      3      3
Four       4      4      4      4

In [103]:
frame.rank(ascending=False)

       item1  item2  item3  item4
one        4      4      4      4
two        3      3      3      3
three      2      2      2      2
Four       1      1      1      1

corr() = function to calculate the correlation
cov()  = function to calculate the covariance

In [104]:
frame.corr()

       item1  item2  item3  item4
item1      1      1      1      1
item2      1      1      1      1
item3      1      1      1      1
item4      1      1      1      1

In [105]:
frame.cov()

           item1      item2      item3      item4
item1  26.666667  26.666667  26.666667  26.666667
item2  26.666667  26.666667  26.666667  26.666667
item3  26.666667  26.666667  26.666667  26.666667
item4  26.666667  26.666667  26.666667  26.666667

corrwith() = To calculate the pairwise correlations between the columns or rows of a data frame with a Series or another DataFrame()

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)))

In [5]:
frame2 = pd.DataFrame(np.arange(16).reshape((4,4)))

In [6]:
frame1.corrwith(frame2)

0    1
1    1
2    1
3    1
dtype: float64

In [7]:
frame3 = pd.DataFrame(np.random.random(16).reshape(4,4))

In [8]:
frame3

          0         1         2         3
0  0.528134  0.270702  0.341169  0.544432
1  0.971395  0.335855  0.251625  0.040220
2  0.159034  0.754791  0.843810  0.238934
3  0.721440  0.111401  0.279240  0.401189

In [9]:
frame1

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
frame1.corrwith(frame3)

0   -0.087581
1   -0.027739
2    0.187989
3   -0.137545
dtype: float64

Creating and droping NaN values

In [11]:
ser = pd.Series([1,2,np.NaN,3],index=[1,2,3,4])

In [12]:
ser

1     1
2     2
3   NaN
4     3
dtype: float64

In [13]:
ser.dropna()

1    1
2    2
4    3
dtype: float64

In [18]:
frame = pd.DataFrame([[1,2,np.NaN],[4,5,6]],index=[1,2],columns=['one','two','three'])

In [19]:
frame

   one  two  three
1    1    2    NaN
2    4    5      6

In [20]:
frame.dropna()

   one  two  three
2    4    5      6

Another way to deal with NaN values without deleting this values one can put zero in NaN values

In [24]:
frame = pd.DataFrame([[1,2,np.NaN],[4,5,6],[np.NaN,8,9]],index=[1,2,3],
                     columns=['one','two','three'])

In [25]:
frame

   one  two  three
1    1    2    NaN
2    4    5      6
3  NaN    8      9

In [26]:
frame.fillna(0)

   one  two  three
1    1    2      0
2    4    5      6
3    0    8      9

In [27]:
frame

   one  two  three
1    1    2    NaN
2    4    5      6
3  NaN    8      9

In [28]:
frame.fillna(1)

   one  two  three
1    1    2      1
2    4    5      6
3    1    8      9

Createing a Series conatining two arrays of indexes , A complex Series Example

In [32]:
ser = pd.Series(np.random.random(9),index=[['white','white','white','blue','blue','blue',
                                           'red','red','red'],['up','down','left','up','down',
                                                              'left','up','down','left']])

In [33]:
ser

white  up      0.487363
       down    0.240737
       left    0.325957
blue   up      0.068782
       down    0.807280
       left    0.382097
red    up      0.945284
       down    0.651012
       left    0.498604
dtype: float64

In [34]:
ser.index

MultiIndex(levels=[[u'blue', u'red', u'white'], [u'down', u'left', u'up']],
           labels=[[2, 2, 2, 0, 0, 0, 1, 1, 1], [2, 0, 1, 2, 0, 1, 2, 0, 1]])

In [35]:
ser['white']

up      0.487363
down    0.240737
left    0.325957
dtype: float64

In [36]:
ser['white']['up']

0.48736292018278193

In [37]:
ser['red']

up      0.945284
down    0.651012
left    0.498604
dtype: float64

In [38]:
ser['red']['down']

0.65101181909480044

In [39]:
ser['blue']['left']

0.38209654738237719

unstack() = The data which is in the DataFrame can be rearranged using unstack() function . This function converts teh Series with hierarchical index in a simple DataFrame , where the second set of indexes is converted into a new set of columns.

In [40]:
ser.unstack()

           down      left        up
blue   0.807280  0.382097  0.068782
red    0.651012  0.498604  0.945284
white  0.240737  0.325957  0.487363

In [41]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),index=['red','blue','yellow','white'],
                    columns=['ball','pen','pencil','paper'])

In [42]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [43]:
frame.stack()

red     ball       0
        pen        1
        pencil     2
        paper      3
blue    ball       4
        pen        5
        pencil     6
        paper      7
yellow  ball       8
        pen        9
        pencil    10
        paper     11
white   ball      12
        pen       13
        pencil    14
        paper     15
dtype: int64

A complex DataFrame Example

In [46]:
frame = pd.DataFrame(np.random.random(16).reshape((4,4)),index=[['white','white','red','red'],
                                                               ['up','down','up','down']],
                    columns = [['pen','pen','paper','paper'],[1,2,1,2]])

In [47]:
frame

                 pen               paper
                   1         2         1         2
white up    0.281799  0.483951  0.410574  0.290204
      down  0.854290  0.980706  0.074594  0.246986
red   up    0.997528  0.079066  0.831371  0.433478
      down  0.754489  0.676146  0.335272  0.775116

In [48]:
frame.index

MultiIndex(levels=[[u'red', u'white'], [u'down', u'up']],
           labels=[[1, 1, 0, 0], [1, 0, 1, 0]])

In [49]:
frame.values

array([[ 0.28179857,  0.48395079,  0.41057368,  0.29020427],
       [ 0.85428958,  0.980706  ,  0.07459424,  0.24698606],
       [ 0.99752824,  0.07906626,  0.83137087,  0.43347846],
       [ 0.75448941,  0.6761456 ,  0.33527196,  0.7751158 ]])

In [50]:
frame['pen']

                   1         2
white up    0.281799  0.483951
      down  0.854290  0.980706
red   up    0.997528  0.079066
      down  0.754489  0.676146

In [55]:
frame['pen'][1]

white  up      0.281799
       down    0.854290
red    up      0.997528
       down    0.754489
Name: 1, dtype: float64

In [56]:
frame['pen'][1].white

up      0.281799
down    0.854290
Name: 1, dtype: float64

In [58]:
frame['pen'][1].white.up

0.28179856604426612

In [59]:
frame['pen'][1].white.down

0.85428958427592738

In [60]:
frame['pen']

                   1         2
white up    0.281799  0.483951
      down  0.854290  0.980706
red   up    0.997528  0.079066
      down  0.754489  0.676146

In [62]:
frame['pen'][2].white.up

0.48395079394180829

In [67]:
print "Price ",frame['pen'][1].white.up + frame['pen'][2].white.up

Price  0.765749359986

In [68]:
frame

                 pen               paper
                   1         2         1         2
white up    0.281799  0.483951  0.410574  0.290204
      down  0.854290  0.980706  0.074594  0.246986
red   up    0.997528  0.079066  0.831371  0.433478
      down  0.754489  0.676146  0.335272  0.775116

In [71]:
frame = pd.DataFrame(np.random.randn(36).reshape((6,6)),index=[['red','red','green','green',
                                                                'blue','blue']
                                                               ,['normal','dark'
     ,'normal','dark','normal','dark']]
                     ,columns=[['color_red','color_red','color_green','color_green'
                                ,'color_blue','color_blue']
    ,[1,2,1,2,1,2]])

In [72]:
frame

             color_red           color_green           color_blue
                     1         2           1         2          1         2
red   normal -0.193200 -1.210857    1.536711  3.343193  -0.228168 -0.945499
      dark    0.045404  0.834747   -2.247210 -2.003760  -0.194406 -1.199418
green normal -0.704023  0.185197    0.070869  1.912009   0.014910  0.232379
      dark    0.597000  0.994928    0.516692  0.074914  -0.248526  1.217471
blue  normal  1.086685  1.415072   -0.147870  0.746550   0.121191  0.959302
      dark    0.584780 -0.069125   -1.066912 -0.648181   0.958402 -0.367134

In [73]:
frame.index.name='colors'

In [74]:
frame

             color_red           color_green           color_blue
                     1         2           1         2          1         2
red   normal -0.193200 -1.210857    1.536711  3.343193  -0.228168 -0.945499
      dark    0.045404  0.834747   -2.247210 -2.003760  -0.194406 -1.199418
green normal -0.704023  0.185197    0.070869  1.912009   0.014910  0.232379
      dark    0.597000  0.994928    0.516692  0.074914  -0.248526  1.217471
blue  normal  1.086685  1.415072   -0.147870  0.746550   0.121191  0.959302
      dark    0.584780 -0.069125   -1.066912 -0.648181   0.958402 -0.367134

In [75]:
frame.index

MultiIndex(levels=[[u'blue', u'green', u'red'], [u'dark', u'normal']],
           labels=[[2, 2, 1, 1, 0, 0], [1, 0, 1, 0, 1, 0]])

In [76]:
frame['color_red']

                     1         2
red   normal -0.193200 -1.210857
      dark    0.045404  0.834747
green normal -0.704023  0.185197
      dark    0.597000  0.994928
blue  normal  1.086685  1.415072
      dark    0.584780 -0.069125

In [77]:
frame['color_red'][1]

red    normal   -0.193200
       dark      0.045404
green  normal   -0.704023
       dark      0.597000
blue   normal    1.086685
       dark      0.584780
Name: 1, dtype: float64

In [78]:
frame['color_red'][1].red

normal   -0.193200
dark      0.045404
Name: 1, dtype: float64

In [79]:
frame['color_red'][1].green

normal   -0.704023
dark      0.597000
Name: 1, dtype: float64